; domain
(define (domain logistics-strips)
  (:requirements :strips :constraints)
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c6-s6-p10-a1)
(:domain logistics-strips)
(:objects a0 
          c0 c1 c2 c3 c4 c5 
          t0 t1 t2 t3 t4 t5 
          l0-0 l0-1 l0-2 l0-3 l0-4 l0-5 l1-0 l1-1 l1-2 l1-3 l1-4 l1-5 l2-0 l2-1 l2-2 l2-3 l2-4 l2-5 l3-0 l3-1 l3-2 l3-3 l3-4 l3-5 l4-0 l4-1 l4-2 l4-3 l4-4 l4-5 l5-0 l5-1 l5-2 l5-3 l5-4 l5-5 
          p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 
)
(:init
    (AIRPLANE a0)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (CITY c3)
    (CITY c4)
    (CITY c5)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (TRUCK t3)
    (TRUCK t4)
    (TRUCK t5)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l0-3)
    (in-city  l0-3 c0)
    (LOCATION l0-4)
    (in-city  l0-4 c0)
    (LOCATION l0-5)
    (in-city  l0-5 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l1-3)
    (in-city  l1-3 c1)
    (LOCATION l1-4)
    (in-city  l1-4 c1)
    (LOCATION l1-5)
    (in-city  l1-5 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (LOCATION l2-3)
    (in-city  l2-3 c2)
    (LOCATION l2-4)
    (in-city  l2-4 c2)
    (LOCATION l2-5)
    (in-city  l2-5 c2)
    (LOCATION l3-0)
    (in-city  l3-0 c3)
    (LOCATION l3-1)
    (in-city  l3-1 c3)
    (LOCATION l3-2)
    (in-city  l3-2 c3)
    (LOCATION l3-3)
    (in-city  l3-3 c3)
    (LOCATION l3-4)
    (in-city  l3-4 c3)
    (LOCATION l3-5)
    (in-city  l3-5 c3)
    (LOCATION l4-0)
    (in-city  l4-0 c4)
    (LOCATION l4-1)
    (in-city  l4-1 c4)
    (LOCATION l4-2)
    (in-city  l4-2 c4)
    (LOCATION l4-3)
    (in-city  l4-3 c4)
    (LOCATION l4-4)
    (in-city  l4-4 c4)
    (LOCATION l4-5)
    (in-city  l4-5 c4)
    (LOCATION l5-0)
    (in-city  l5-0 c5)
    (LOCATION l5-1)
    (in-city  l5-1 c5)
    (LOCATION l5-2)
    (in-city  l5-2 c5)
    (LOCATION l5-3)
    (in-city  l5-3 c5)
    (LOCATION l5-4)
    (in-city  l5-4 c5)
    (LOCATION l5-5)
    (in-city  l5-5 c5)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (AIRPORT l3-0)
    (AIRPORT l4-0)
    (AIRPORT l5-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (OBJ p8)
    (OBJ p9)
    (at t0 l0-0)
    (at t1 l1-0)
    (at t2 l2-5)
    (at t3 l3-1)
    (at t4 l4-5)
    (at t5 l5-5)
    (at p0 l2-0)
    (at p1 l4-4)
    (at p2 l1-5)
    (at p3 l0-2)
    (at p4 l0-5)
    (at p5 l2-2)
    (at p6 l5-4)
    (at p7 l3-1)
    (at p8 l2-5)
    (at p9 l1-0)
    (at a0 l2-0)
)
(:goal
    (and
        (at p0 l4-2)
        (at p1 l0-0)
        (at p2 l4-0)
        (at p3 l1-2)
        (at p4 l1-4)
        (at p5 l1-1)
        (at p6 l4-3)
        (at p7 l4-3)
        (at p8 l2-4)
        (at p9 l4-0)
    )
)

  (:constraints
    (always (not (in p8 a0)))
  )
)

; plan
1. (drive-truck t5 l5-5 l5-4 c5)
   deleted: (at t5 l5-5)
   added: (at t5 l5-4)
   goals met: 0 of 10
2. (drive-truck t4 l4-5 l4-4 c4)
   deleted: (at t4 l4-5)
   added: (at t4 l4-4)
   goals met: 0 of 10
3. (load-airplane p0 a0 l2-0)
   deleted: (at p0 l2-0)
   added: (in p0 a0)
   goals met: 0 of 10
4. (load-truck p7 t3 l3-1)
   deleted: (at p7 l3-1)
   added: (in p7 t3)
   goals met: 0 of 10
5. (load-truck p8 t2 l2-5)
   deleted: (at p8 l2-5)
   added: (in p8 t2)
   goals met: 0 of 10
6. (drive-truck t1 l1-0 l1-5 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-5)
   goals met: 0 of 10
7. (drive-truck t0 l0-0 l0-5 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-5)
   goals met: 0 of 10
8. (drive-truck t3 l3-1 l3-0 c3)
   deleted: (at t3 l3-1)
   added: (at t3 l3-0)
   goals met: 0 of 10
9. (drive-truck t2 l2-5 l2-4 c2)
   deleted: (at t2 l2-5)
   added: (at t2 l2-4)
   goals met: 0 of 10
10. (load-truck p6 t5 l5-4)
   deleted: (at p6 l5-4)
   added: (in p6 t5)
   goals met: 0 of 10
11. (load-truck p1 t4 l4-4)
   deleted: (at p1 l4-4)
   added: (in p1 t4)
   goals met: 0 of 10
12. (load-truck p2 t1 l1-5)
   deleted: (at p2 l1-5)
   added: (in p2 t1)
   goals met: 0 of 10
13. (load-truck p4 t0 l0-5)
   deleted: (at p4 l0-5)
   added: (in p4 t0)
   goals met: 0 of 10
14. (drive-truck t5 l5-4 l5-0 c5)
   deleted: (at t5 l5-4)
   added: (at t5 l5-0)
   goals met: 0 of 10
15. (drive-truck t4 l4-4 l4-3 c4)
   deleted: (at t4 l4-4)
   added: (at t4 l4-3)
   goals met: 0 of 10
16. (unload-truck p7 t3 l3-0)
   deleted: (in p7 t3)
   added: (at p7 l3-0)
   goals met: 0 of 10
17. (unload-truck p8 t2 l2-4)
   deleted: (in p8 t2)
   added: (at p8 l2-4)
   goals met: 1 of 10
18. (drive-truck t1 l1-5 l1-4 c1)
   deleted: (at t1 l1-5)
   added: (at t1 l1-4)
   goals met: 1 of 10
19. (drive-truck t0 l0-5 l0-2 c0)
   deleted: (at t0 l0-5)
   added: (at t0 l0-2)
   goals met: 1 of 10
20. (drive-truck t2 l2-4 l2-2 c2)
   deleted: (at t2 l2-4)
   added: (at t2 l2-2)
   goals met: 1 of 10
21. (unload-truck p6 t5 l5-0)
   deleted: (in p6 t5)
   added: (at p6 l5-0)
   goals met: 1 of 10
22. (load-truck p3 t0 l0-2)
   deleted: (at p3 l0-2)
   added: (in p3 t0)
   goals met: 1 of 10
23. (drive-truck t4 l4-3 l4-0 c4)
   deleted: (at t4 l4-3)
   added: (at t4 l4-0)
   goals met: 1 of 10
24. (drive-truck t1 l1-4 l1-0 c1)
   deleted: (at t1 l1-4)
   added: (at t1 l1-0)
   goals met: 1 of 10
25. (load-truck p5 t2 l2-2)
   deleted: (at p5 l2-2)
   added: (in p5 t2)
   goals met: 1 of 10
26. (drive-truck t0 l0-2 l0-0 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-0)
   goals met: 1 of 10
27. (unload-truck p1 t4 l4-0)
   deleted: (in p1 t4)
   added: (at p1 l4-0)
   goals met: 1 of 10
28. (unload-truck p2 t1 l1-0)
   deleted: (in p2 t1)
   added: (at p2 l1-0)
   goals met: 1 of 10
29. (drive-truck t2 l2-2 l2-0 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-0)
   goals met: 1 of 10
30. (unload-truck p5 t2 l2-0)
   deleted: (in p5 t2)
   added: (at p5 l2-0)
   goals met: 1 of 10
31. (load-airplane p5 a0 l2-0)
   deleted: (at p5 l2-0)
   added: (in p5 a0)
   goals met: 1 of 10
32. (fly-airplane a0 l2-0 l5-0)
   deleted: (at a0 l2-0)
   added: (at a0 l5-0)
   goals met: 1 of 10
33. (load-airplane p6 a0 l5-0)
   deleted: (at p6 l5-0)
   added: (in p6 a0)
   goals met: 1 of 10
34. (fly-airplane a0 l5-0 l4-0)
   deleted: (at a0 l5-0)
   added: (at a0 l4-0)
   goals met: 1 of 10
35. (unload-airplane p6 a0 l4-0)
   deleted: (in p6 a0)
   added: (at p6 l4-0)
   goals met: 1 of 10
36. (unload-airplane p0 a0 l4-0)
   deleted: (in p0 a0)
   added: (at p0 l4-0)
   goals met: 1 of 10
37. (load-airplane p1 a0 l4-0)
   deleted: (at p1 l4-0)
   added: (in p1 a0)
   goals met: 1 of 10
38. (load-truck p6 t4 l4-0)
   deleted: (at p6 l4-0)
   added: (in p6 t4)
   goals met: 1 of 10
39. (fly-airplane a0 l4-0 l3-0)
   deleted: (at a0 l4-0)
   added: (at a0 l3-0)
   goals met: 1 of 10
40. (load-airplane p7 a0 l3-0)
   deleted: (at p7 l3-0)
   added: (in p7 a0)
   goals met: 1 of 10
41. (fly-airplane a0 l3-0 l4-0)
   deleted: (at a0 l3-0)
   added: (at a0 l4-0)
   goals met: 1 of 10
42. (unload-airplane p7 a0 l4-0)
   deleted: (in p7 a0)
   added: (at p7 l4-0)
   goals met: 1 of 10
43. (load-truck p0 t4 l4-0)
   deleted: (at p0 l4-0)
   added: (in p0 t4)
   goals met: 1 of 10
44. (load-truck p7 t4 l4-0)
   deleted: (at p7 l4-0)
   added: (in p7 t4)
   goals met: 1 of 10
45. (fly-airplane a0 l4-0 l1-0)
   deleted: (at a0 l4-0)
   added: (at a0 l1-0)
   goals met: 1 of 10
46. (drive-truck t4 l4-0 l4-3 c4)
   deleted: (at t4 l4-0)
   added: (at t4 l4-3)
   goals met: 1 of 10
47. (unload-airplane p5 a0 l1-0)
   deleted: (in p5 a0)
   added: (at p5 l1-0)
   goals met: 1 of 10
48. (load-airplane p9 a0 l1-0)
   deleted: (at p9 l1-0)
   added: (in p9 a0)
   goals met: 1 of 10
49. (load-airplane p2 a0 l1-0)
   deleted: (at p2 l1-0)
   added: (in p2 a0)
   goals met: 1 of 10
50. (unload-truck p7 t4 l4-3)
   deleted: (in p7 t4)
   added: (at p7 l4-3)
   goals met: 2 of 10
51. (unload-truck p6 t4 l4-3)
   deleted: (in p6 t4)
   added: (at p6 l4-3)
   goals met: 3 of 10
52. (load-truck p5 t1 l1-0)
   deleted: (at p5 l1-0)
   added: (in p5 t1)
   goals met: 3 of 10
53. (fly-airplane a0 l1-0 l4-0)
   deleted: (at a0 l1-0)
   added: (at a0 l4-0)
   goals met: 3 of 10
54. (drive-truck t4 l4-3 l4-2 c4)
   deleted: (at t4 l4-3)
   added: (at t4 l4-2)
   goals met: 3 of 10
55. (drive-truck t1 l1-0 l1-1 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 3 of 10
56. (unload-airplane p9 a0 l4-0)
   deleted: (in p9 a0)
   added: (at p9 l4-0)
   goals met: 4 of 10
57. (unload-airplane p2 a0 l4-0)
   deleted: (in p2 a0)
   added: (at p2 l4-0)
   goals met: 5 of 10
58. (unload-truck p0 t4 l4-2)
   deleted: (in p0 t4)
   added: (at p0 l4-2)
   goals met: 6 of 10
59. (unload-truck p5 t1 l1-1)
   deleted: (in p5 t1)
   added: (at p5 l1-1)
   goals met: 7 of 10
60. (fly-airplane a0 l4-0 l1-0)
   deleted: (at a0 l4-0)
   added: (at a0 l1-0)
   goals met: 7 of 10
61. (unload-truck p4 t0 l0-0)
   deleted: (in p4 t0)
   added: (at p4 l0-0)
   goals met: 7 of 10
62. (unload-truck p3 t0 l0-0)
   deleted: (in p3 t0)
   added: (at p3 l0-0)
   goals met: 7 of 10
63. (drive-truck t1 l1-1 l1-4 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-4)
   goals met: 7 of 10
64. (fly-airplane a0 l1-0 l0-0)
   deleted: (at a0 l1-0)
   added: (at a0 l0-0)
   goals met: 7 of 10
65. (unload-airplane p1 a0 l0-0)
   deleted: (in p1 a0)
   added: (at p1 l0-0)
   goals met: 8 of 10
66. (load-airplane p4 a0 l0-0)
   deleted: (at p4 l0-0)
   added: (in p4 a0)
   goals met: 8 of 10
67. (load-airplane p3 a0 l0-0)
   deleted: (at p3 l0-0)
   added: (in p3 a0)
   goals met: 8 of 10
68. (drive-truck t1 l1-4 l1-0 c1)
   deleted: (at t1 l1-4)
   added: (at t1 l1-0)
   goals met: 8 of 10
69. (fly-airplane a0 l0-0 l1-0)
   deleted: (at a0 l0-0)
   added: (at a0 l1-0)
   goals met: 8 of 10
70. (unload-airplane p4 a0 l1-0)
   deleted: (in p4 a0)
   added: (at p4 l1-0)
   goals met: 8 of 10
71. (unload-airplane p3 a0 l1-0)
   deleted: (in p3 a0)
   added: (at p3 l1-0)
   goals met: 8 of 10
72. (load-truck p4 t1 l1-0)
   deleted: (at p4 l1-0)
   added: (in p4 t1)
   goals met: 8 of 10
73. (load-truck p3 t1 l1-0)
   deleted: (at p3 l1-0)
   added: (in p3 t1)
   goals met: 8 of 10
74. (drive-truck t1 l1-0 l1-4 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-4)
   goals met: 8 of 10
75. (unload-truck p4 t1 l1-4)
   deleted: (in p4 t1)
   added: (at p4 l1-4)
   goals met: 9 of 10
76. (drive-truck t1 l1-4 l1-2 c1)
   deleted: (at t1 l1-4)
   added: (at t1 l1-2)
   goals met: 9 of 10
77. (unload-truck p3 t1 l1-2)
   deleted: (in p3 t1)
   added: (at p3 l1-2)
   goals met: 10 of 10
